<?php
return [
    'required' => 'هذا الحقل مطلوب',
    'min' => 'هذا الحقل يجب أن يكون على الأقل :min أحرف',
    'max' => 'هذا الحقل يجب أن لا يتجاوز :max أحرف',
    'email' => 'هذا الحقل يجب أن يكون بريد إلكتروني صحيح',
    'unique' => 'هذا الحقل تم أخذه بالفعل',
    'confirmed' => 'تأكيد الحقل غير صحيح',
    'image' => 'هذا الحقل يجب أن يكون صورة',
    'phone' => 'يجب أن يكون رقم الهاتف عماني صحيح (8 أرقام، مع رمز الدولة أو بدونه)',
    'password_uppercase' => 'يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل',
    'exists' => 'القيمة المحددة لـ :attribute غير موجودة',
    'user_not_found' => 'المستخدم غير موجود',
    'current_password' => 'كلمة المرور الحالية غير صحيحة',
    'digits' => 'يجب أن يكون :attribute مكون من :digits أرقام',
    'same' => 'يجب أن يكون :attribute مطابق لـ :other',
    'string' => 'يجب أن يكون :attribute نص',
];